neosoultech/bioimpedance_msp430_test/main.c
                                // Overview
// Test code for a wearable, phone-powered bio-impedance patch sensor powered by energy harvesting.
// Parts include ST25DV-04K (NFC chip), MSP430FR2433 (MCU), and MAX30002 (Bio-impedance Sensor)
// Code is WIP, all tests are modular and not meant to be run at same time.
// MAX30002 communicates via SPI with MCU, while ST25 utilizes I2C.

                                // MAX30002 Information
// SPI interface
// ACLK (clock speed) at ~32KHz REFO
// - Data flow: BioZ measurement --> sample placed into FIFO --> FIFO reaches threshold --> INTB goes low on P2.1 falling edge
// --> PORT2 ISR --> max_flag = 1 --> main loop detects max_flag --> MCU reads STATUS --> MCU drains FIFO --> MCU parses bioZ data
// Note: FCLK must be present or no data generated, FIFO must be drained to prevent overflow, data interrupt-driven
// For eval board (MAX30001EVSYS), a 32kHz crystal oscillator is already provided, so FCLK on MSP is disabled.

// MAX30002 FIFO FORMAT:
// 24 bit word: bits [23:4] are 20-bit signed BioZ sample (2SC), bit [3]: zero padding, bits [2:0]: BTAG status tag
// BTAG: 000 valid, 001 over/under range, 010 valid EOF, 011 over/under EOF
// Note: Extract bits [23:4], mask 20 bits, and sign extend bit 19.


                                // ST25 Information
// I2C interface
// - Data flow: Phone tap --> ST25 asserts GPO on P2.0 falling edge --> PORT2 ISR --> phone_flag = 1 --> main loop detects phone_flag
// --> MCU reads/writes EEPROM --> data transmitted to/from phone.
// Note: GPO requires pull-up resistor
//

                            // MSP430 Information
// CPU clock: 1MHz (SMCLK)
// Timing assumptions based on 1MHz: __delay_cycles(x) --> x cycles = x microseconds
// Peripheral timings: I2C clock and SPI clock = 100KHz (UCBOBRW and UCAOBRW)
//


                            //PREEXISTING WIRING (ST25)
//  P1.0: LED (status/debug indicator)
//  P1.2: SDA (serial data wire for I2C)
//  P1.3: SCL (clock wire for I2C)
//  P2.0: GPO (ST25 GPO input. Sets phone_flag)

                            //PREEXISTING WIRING (MAX)
//  P1.4: MOSI (master to slave data line)
//  P1.5: MISO (slave to master data line)
//  P1.6: SCLK (clock wire for SPI)
//  P1.7: CS (Chip select to initiate comms)
//  P2.1: INTB (FIFO/data-ready interrupt. Sets max_flag)
//  P2.2: FCLK (clock output ~32KHz ACLK to MAX30002)
//  P2.7: MUX_SEL on custom patch PCB only. Controls ADG884 target/reference mux.
//        Not used in TEST_MAX_2SPOT_MANUAL eval-board workflow.


                            // LED Notes:
// LED pulses once if transmission occurs successfully.
// LED blinks on and off if measurement is occurring.
// LED stays solid if error
// LED is off if IDLE/SLEEP.

#include <msp430.h>
#include <stdint.h>
#include <stdio.h>
#define USE_LPM              0 // 0 = Normal (debug), 1 = low power
#define BIOZ_LOG_N 128
                                // INTERRUPT HANDLER
// external interrupts from P2.0 (ST25 GPO): Indicates phone interaction, sets phone_flag
// external interrupts from P2.1 (MAX30002 INTB): Indicates data ready / FIFO event, sets max_flag
volatile int32_t debug_bioz = 0; // debugging
volatile uint32_t sample_count = 0; // debugging
volatile int32_t debug_target_bioz = 0;
volatile int32_t bioz_log_value[BIOZ_LOG_N] = {0};
volatile uint16_t bioz_log_i = 0;
volatile uint8_t bioz_log_done = 0;
volatile int32_t debug_print_count = 0;
volatile int32_t debug_baseline_bioz = 0;
volatile int32_t debug_bioz_diff = 0;
volatile uint32_t debug_info = 0;
volatile uint32_t debug_en_int_read = 0;
volatile uint8_t debug_config_pass = 0;
volatile uint32_t debug_en_int_start = 0;
volatile uint32_t debug_mngr_int_start = 0;
volatile uint32_t debug_gen_start = 0;
volatile uint32_t debug_bmux_start = 0;
volatile uint32_t debug_bioz_start = 0;
volatile uint8_t debug_start_pass = 0;
volatile uint32_t debug_bovf_count = 0;
volatile uint8_t demo_msg[180] = {0};
volatile uint16_t demo_msg_len = 0;
volatile int32_t demo_fake_target = 6285;
volatile int32_t demo_fake_reference = 5316;
volatile uint8_t debug_st25_ctrl = 0;
volatile uint8_t debug_st25_sso = 0;
volatile uint8_t debug_st25_fail_step = 0;
volatile uint8_t debug_ctrl_user = 0;
volatile uint8_t debug_ctrl_data = 0;
volatile unsigned int debug_eeprom_offset = 0; // EEPROM chunk offset during NDEF write
volatile unsigned int debug_eeprom_total_len = 0; // total TLV length being written
volatile unsigned int debug_eeprom_chunk_len = 0; // current chunk length
volatile uint8_t debug_eeprom_fail_reason = 0; // 1=len/null fail, 2=chunk write fail
volatile uint8_t demo_result_pending = 0; // 0 = next tap measures/writes result, 1 = next tap resets tag to rea
volatile uint8_t debug_max_collect_failed = 0;
volatile uint32_t debug_max_wait_timeout_count = 0;
volatile uint8_t debug_st25_eh_ctrl_before = 0;
volatile uint8_t debug_st25_eh_ctrl_after = 0;
volatile uint8_t debug_st25_eh_mode_before = 0;
volatile uint8_t debug_st25_eh_mode_after = 0;


volatile int phone_flag = 0;
volatile int max_flag = 0;
#pragma vector=PORT2_VECTOR
__interrupt void Port_2_ISR(void)
{
    if (P2IFG & BIT0) { // if GPO interrupt occurs on P2.0
        phone_flag = 1; // enable phone flag
        P2IFG &= ~BIT0; // clear interrupt flag
    }

    if (P2IFG & BIT1) { // if INTB interrupt occurs on P2.1
        max_flag = 1; // enable max flag
        P2IFG &= ~BIT1; // clear interrupt flag
    }
#if USE_LPM
    __bic_SR_register_on_exit(LPM0_bits); // exiting LPM upon interrupt
#endif
}
                                            //

                            // MAX30002 REGISTER MAP //
// MAX30002 config bit masks
#define MAX_REG_STATUS      0x01
#define MAX_REG_EN_INT      0x02
#define MAX_REG_EN_INT2     0x03
#define MAX_REG_MNGR_INT    0x04
#define MAX_REG_MNGR_DYN    0x05
#define MAX_REG_SW_RST      0x08
#define MAX_REG_SYNCH       0x09
#define MAX_REG_FIFO_RST    0x0A
#define MAX_REG_INFO        0x0F
#define MAX_REG_CNFG_GEN    0x10
#define MAX_REG_CNFG_BMUX   0x17
#define MAX_REG_CNFG_BIOZ   0x18
#define MAX_REG_FIFO_BURST  0x22
#define MAX_REG_FIFO        0x23

//STATUS
#define MAX_STATUS_BINT   (1UL << 19)  // BioZ FIFO interrupt
#define MAX_STATUS_BOVF   (1UL << 18)

