neosoultech/bioimpedance_msp430_test/main.c
// EN_INT bits
#define MAX_EN_INT_BINT     (1UL << 19) // enable BIOZ FIFO interrupt on external INTB pin
#define MAX_EN_INT_BOVF     (1UL << 18) // enable BIOZ FIFO overflow interrupt on INTB pin
#define MAX_INTB_DISABLED        0x000000 // D[1:0] = 00
#define MAX_INTB_CMOS            0x000001 // D[1:0] = 01
#define MAX_INTB_OPEN_DRAIN      0x000002 // D[1:0] = 10
#define MAX_INTB_OD_PULLUP       0x000003 // D[1:0] = 11 --> 125k pullup, default
#define MAX_CFG_EN_INT_START  (MAX_EN_INT_BINT | MAX_EN_INT_BOVF | MAX_INTB_OPEN_DRAIN) // EN_INT starting settings

    // CNFG_GEN
#define MAX_CNFG_GEN_EN_BIOZ     (1UL << 18) // enable BioZ channel
#define MAX_CNFG_GEN_EN_RBIAS    (2UL << 4)  // EN_RBIAS[1:0] = 10, BioZ resistive bias enabled
#define MAX_CNFG_GEN_RBIASV_100M (1UL << 2)  // RBIASV[1:0] = 01, 100M ohm bias
#define MAX_CNFG_GEN_RBIASP      (1UL << 1)  // enable bias on BIP
#define MAX_CNFG_GEN_RBIASN      (1UL << 0)  // enable bias on BIN
// CNFG_GEN starting settings for BIOZ, RBIAS, 100M, RBIASP, and RBIASN //
#define MAX_CFG_CNFG_GEN_START   (MAX_CNFG_GEN_EN_BIOZ      | \
                                   MAX_CNFG_GEN_EN_RBIAS    | \
                                   MAX_CNFG_GEN_RBIASV_100M | \
                                   MAX_CNFG_GEN_RBIASP      | \
                                   MAX_CNFG_GEN_RBIASN)
    // CNFG_BMUX
#define MAX_BMUX_OPENP_BIT        (1UL << 21) // bit is 1 when BIP isolated
#define MAX_BMUX_OPENN_BIT        (1UL << 20) // bit is 1 when BIN isolated

    // MNGR_INT
#define MAX_MNGR_INT_CLR_SAMP    (1UL << 2) // self clear SAMP interrupt after 1/4 data rate cycle
#define MAX_MNGR_INT_BFIT_1_SAMP (0UL << 16) // interrupt at 1 unread FIFO sample
#define MAX_CFG_MNGR_INT_START   (MAX_MNGR_INT_BFIT_1_SAMP | MAX_MNGR_INT_CLR_SAMP) // MNGR start settings

    // MAX30002 CNFG_BIOZ field values for near-10kHz BioZ start
#define MAX_BIOZ_RATE_32SPS      (1UL << 23)
#define MAX_BIOZ_AHPF_BYPASS   (6UL << 20)
#define MAX_BIOZ_USE_INTERNAL_BIASGEN (0UL << 19)
#define MAX_BIOZ_LOW_NOISE       (1UL << 18)
#define MAX_BIOZ_GAIN_10         (0UL << 16)
#define MAX_BIOZ_DHPF_0P05HZ     (1UL << 14)
#define MAX_BIOZ_DHPF_BYPASS     (0UL << 14)
#define MAX_BIOZ_DLPF_4HZ        (1UL << 12)
#define MAX_BIOZ_FCGEN_8192HZ    (4UL << 8)
#define MAX_BIOZ_CGMON_OFF       (0UL << 7)
#define MAX_BIOZ_CGMAG_TEST      (3UL << 4)
#define MAX_BIOZ_PHOFF_0         (0UL << 0)
#define MAX_CFG_CNFG_BIOZ_START  (\
    MAX_BIOZ_RATE_32SPS             | /* 32 samples per second to save power */ \
    MAX_BIOZ_AHPF_BYPASS             |/* AHPF[2:0] = 110, bypass analog HPF. Measurements are more accurate on low freq with HPF disabled. */ \
    MAX_BIOZ_USE_INTERNAL_BIASGEN   | /* Use MAX30002 internal bias generator instead of external resistor */ \
    MAX_BIOZ_LOW_NOISE              | /* Low noise mode (cleaner data, but more power) */ \
    MAX_BIOZ_GAIN_10                | /* 10 V/V gain; testing lowest 1st */ \
    MAX_BIOZ_DHPF_BYPASS            | /* Digital HPF disabled (was destroying steady signal) */ \
    MAX_BIOZ_DLPF_4HZ               | /* Digital LPF to reduce noise and output bandwidth */ \
    MAX_BIOZ_FCGEN_8192HZ           | /* 8.192KHz generated current frequency, closest to 10KHz (wanted previously) */ \
    MAX_BIOZ_CGMON_OFF              | /* Current generator compliance monitor OFF. Diagnostic for later */ \
    MAX_BIOZ_CGMAG_TEST             | /* 32uA injected current magnitude. Using middle low value. */ \
    MAX_BIOZ_PHOFF_0)                 /* No phase offset */

    // MAX30002 MUX SELECT (MCU CHOOSES). MAX is still a single BioZ channel. The ADG884 muxes select whether MAX30002 BioZ path connects to target or reference electrode set.
    // Sequential, not simultaneous
    // P2.7 controls ADG884 IN1/IN2 pins.
    // MUX_SEL = 1 selects TARGET electrodes, while MUX_SEL = 0 selects BASELINE electrodes
#define BIOZ_MUX_SEL_BIT    BIT7
#define BIOZ_SELECT_TARGET()    (P2OUT |= BIOZ_MUX_SEL_BIT)
#define BIOZ_SELECT_BASELINE()  (P2OUT &= ~BIOZ_MUX_SEL_BIT)
#define BIOZ_DISCARD_SAMPLES 64
#define BIOZ_BLOCK_MISMATCH_LIMIT 500

                                    //

                             // ST25DV REGISTER MAP //

// ST25DV I2C addresses
// MSP430 uses 7-bit slave addresses.
// ST25DV device select code: 1010 E2 1 1 R/W
// E2 = 0 -> user memory, dynamic registers
// E2 = 1 -> system configuration area
#define ST25DV_ADDR_USER              0x53
#define ST25DV_ADDR_SYSTEM            0x57

// ST25DV user EEPROM test address
#define ST25DV_TEST_EEPROM_ADDR       0x01F0

// ST25DV I2C password command address, E2 = 1
#define ST25DV_I2C_PWD_ADDR           0x0900
#define ST25DV_PRESENT_PWD_CODE       0x09

// ST25DV dynamic registers, E2 = 0
#define ST25DV_REG_I2C_SSO_DYN        0x2004

// I2C_SSO_Dyn bits
#define ST25DV_I2C_SSO_OPEN           0x01

// ST25DV energy harvesting dynamic register

#define ST25DV_REG_EH_CTRL_DYN 0x2002
#define ST25DV_EH_CTRL_DYN_EH_EN BIT0
#define ST25DV_EH_CTRL_DYN_EH_ON BIT1
#define ST25DV_EH_CTRL_DYN_FIELD_ON BIT2
#define ST25DV_EH_CTRL_DYN_VCC_ON BIT3
#define ST25DV_REG_EH_MODE             0x0002  // system area register
#define ST25DV_EH_MODE_ENABLE_AUTO     0x00    // bit0 cleared = auto EH enabled
#define ST25DV_EH_MODE_DISABLE_AUTO    BIT0    // bit0 set = auto EH disabled

// URL info
#define BIOZ_URL_SCANNING "apps.powerapps.com/play/acef55d5-b582-4b23-9945-7312b9c0f7d5?tenantId=d196a604-d993-4028-90df-e223d68126d2&mode=scanning&skipMobileRedirect=1"
#define BIOZ_URL_RESULT_BASE "apps.powerapps.com/play/acef55d5-b582-4b23-9945-7312b9c0f7d5?tenantId=d196a604-d993-4028-90df-e223d68126d2&mode=result&skipMobileRedirect=1&b="

                                        //

                      //TEST MODE MACROS. ONLY 1 AT A TIME CAN BE ENABLED. //
// PASSED TESTS: TEST_MAX_SPI, TEST_MAX_ID, TEST_MAX_CONFIG, TEST_MAX_START, TEST_MAX_READ, TEST_MAX_2SPOT_MANUAL, TEST_BUILD_BIOZ_MSG_ONLY, TEST_ST25_READ, TEST_ST25_WRITE, TEST_ST25_GPO
#define TEST_MODE                 1
// if test mode enabled...
#define TEST_ST25_WRITE           0
#define TEST_ST25_READ            0
#define TEST_ST25_GPO             0
#define RUN_PHONE_NFC_DEMO         1

#define TEST_MAX_SPI              0
#define TEST_MAX_ID               0
#define TEST_MAX_CONFIG           0
#define TEST_MAX_START            0
#define TEST_MAX_READ             0
#define TEST_MAX_2SPOT            0
#define TEST_MAX_2SPOT_MANUAL     0
#define TEST_BUILD_BIOZ_MSG_ONLY  0


#define USE_BIOZ_MUX (TEST_MAX_2SPOT || TEST_MAX_START || TEST_MAX_READ || RUN_PHONE_NFC_DEMO)
#define USE_EXP430_S1       (TEST_MAX_2SPOT_MANUAL)
#define USE_MSP_FCLK          0
#define DEMO_WRITE_SCANNING_ON_BOOT 1


                                        //

                        // OTHER MACROS (DON'T CHANGE)
#define LED_ON()      (P1OUT |= BIT0) // LED on indicates error.
#define LED_OFF()     (P1OUT &= ~BIT0) // LED off indicates IDLE/SLEEP
#define LED_TOGGLE()  (P1OUT ^= BIT0) // macro to toggle LED on and off. --> Indicates that sensing/transmission occuring
#define MAX_CS_LOW()  (P1OUT &= ~BIT7) //select MAX30002, CS active low
#define MAX_CS_HIGH() (P1OUT |= BIT7) // deselect MAX30002
#define BUTTON_S1_BIT BIT3            // S1 button on EXP430 is BIT3
                                        //

                        // FUNCTION DECLARATIONS
int st25dv_write(uint8_t slave, uint16_t mem_addr, uint8_t data);
int st25dv_enable_energy_harvesting_dynamic(void);
void i2c_init();
void i2c_pins_init();
void i2c_bus_recover(void);
void error_handler(void);
void led_blink_measuring(void);
void led_pulse_transmission(void);
void led_idle(void);
void led_double_pulse(void);
uint8_t st25dv_read(uint8_t slave, uint16_t addr);
void gpo_init();
int check_nack();
void wait_tx_ready();
int i2c_send_and_check(uint8_t byte);
int st25dv_present_i2c_password(void);
int st25dv_i2c_session_is_open(void);
int st25dv_write_ndef_text_eeprom(uint8_t *ndef_msg, unsigned int ndef_len); // Writes a complete NDEF message into normal ST25 EEPROM tag memory
int st25dv_enable_energy_harvesting_static(void);
int wait_tx_ready_timeout(void);
int st25dv_write_sequence(uint8_t slave, uint16_t mem_addr, uint8_t *data, unsigned int length);
void max_int_init(void);
void wait_rx_ready(void);
void spi_init(void);
void spi_pins_init(void);
uint8_t spi_transfer(uint8_t data);
uint32_t max30002_read_reg(uint8_t reg);
void max30002_write_reg(uint8_t reg, uint32_t data);
void max30002_reset(void);
void max30002_fifo_reset(void);
uint32_t max30002_read_info(void);
uint32_t max30002_read_status(void);
uint32_t max30002_read_fifo(void);
void max30002_synch(void);
void fclk_init(void);
int32_t bioz_parse(uint32_t raw);
void bioz_mux_init(void);
void max30002_configure_bioz_once(void);
void bioz_prepare_selected_path(void);
int32_t max30002_collect_bioz_average(uint16_t sample_goal);
void button_s1_init(void);
void wait_for_s1_press(void);
uint16_t append_str(uint8_t *buf, uint16_t idx, uint16_t max, const char *s);
uint16_t build_bioz_ndef_text_msg(uint8_t *out, uint16_t max_len, int32_t target_raw, int32_t reference_raw);
uint16_t append_url_int32(uint8_t buf[], uint16_t idx, uint16_t max, int32_t value);
uint16_t append_url_x10(uint8_t buf[], uint16_t idx, uint16_t max, int32_t value_x10);
uint16_t build_scanning_url_ndef(uint8_t out[], uint16_t max_len);
//

int main(void)
{
	WDTCTL = WDTPW | WDTHOLD;	// stop watchdog timer
	 PM5CTL0 &= ~LOCKLPM5;       // Unlock GPIO ports to activate I/O pins
	// LED
	P1DIR |= BIT0; // setting pin 1.0 as LED output (1)
	P1OUT &= ~BIT0; // setting pin 1.0 to a 0 as value

