neosoultech/bioimpedance_msp430_test/main.c
	// init
	i2c_pins_init();
	i2c_init();
	i2c_bus_recover(); // force I2C bus/pins back to clean idle state after previous stuck transaction
	spi_pins_init();
	spi_init();
	#if USE_BIOZ_MUX
	    bioz_mux_init();
	#endif
    #if USE_MSP_FCLK
	fclk_init();
    #endif
	#if USE_EXP430_S1
	    button_s1_init();
	#endif
	gpo_init();
	max_int_init();
#if DEMO_WRITE_SCANNING_ON_BOOT
    {
        uint8_t msg[260];
        uint16_t msg_len;

        debug_st25_fail_step = 80; // writing scanning URL at boot

        msg_len = build_scanning_url_ndef(msg, sizeof(msg));

        if (msg_len == 0) {
            debug_st25_fail_step = 81; // scan URL builder failed at boot
            error_handler();
        }

        if (st25dv_write_ndef_text_eeprom(msg, msg_len)) {
            demo_result_pending = 0;
            debug_st25_fail_step = 0;
            led_double_pulse(); // boot scan reset complete
        }
        else {
            debug_st25_fail_step = 82; // scan URL EEPROM write failed at boot
            error_handler();
        }

        phone_flag = 0; // clear any stale GPO event from startup
        P2IFG &= ~BIT0;
    }
#endif
	__enable_interrupt(); // enabling global interrupts


	// TEST FUNCTIONS
	while(1) {
#if TEST_MODE // if test mode enabled


    #if TEST_ST25_WRITE // TEST 1: MCU WRITE --> ST25
	    if (st25dv_write(ST25DV_ADDR_USER, ST25DV_TEST_EEPROM_ADDR, 0xAA)) { // sending test byte 0xAA to address 0x01F0 on ST25DV (slave addr 0x53). Checking to see if successful (ST25DV will respond)
	                led_pulse_transmission(); // pulse LED if transmission success
	                }
	            else {
	                error_handler(); // if not successful (ERR), LED is solid forever
	            }

    #elif TEST_ST25_READ // TEST 2: MCU READ <-- ST25
	    uint8_t val; // declare value variable
	    st25dv_write(ST25DV_ADDR_USER, ST25DV_TEST_EEPROM_ADDR, 0xAA); // write 0xAA to 0x01F0 on st25dv
	    __delay_cycles(1000000); // 1s to wait for it to store in mem
	    val = st25dv_read(ST25DV_ADDR_USER, ST25DV_TEST_EEPROM_ADDR); // reading it back from 0x01F0
	    if (val == 0xAA){
	        led_pulse_transmission(); // pulse LED for success
	    }
	    else {
	        error_handler(); // solid for failure
	    }
	    __delay_cycles(1000000);

    #elif TEST_ST25_GPO // TEST 3: SEE IF ST25 SENDS PHONE DETECT SIGNAL ON GPO
	    if (phone_flag == 1) { // if detect phone
	        phone_flag = 0; // clear interrupt event after handling
	        led_pulse_transmission(); // pulse LED
	    }
	    else {
	        led_idle(); // LED stays off
	    }

#elif RUN_PHONE_NFC_DEMO // Phone tap demo: ready -> scan -> result -> auto reset ready using phone_flag only
        if (phone_flag) {
            phone_flag = 0;

            uint8_t msg[260];
            uint16_t msg_len;

            if (demo_result_pending == 0) {
                // First tap: user is on scan page.
                // Wait a bit so phone finishes reading the scan URL, then measure and write result.

                int32_t target_avg;
                int32_t reference_avg;

                // TARGET MEASUREMENT
                debug_st25_fail_step = 60; // entered first tap / measure-result path

                __delay_cycles(2000000); // 2 sec delay after NFC trigger


                debug_st25_fail_step = 65; // about to configure MAX

                debug_max_collect_failed = 0;
                debug_max_wait_timeout_count = 0;
                max_flag = 0;

                max30002_configure_bioz_once();

                debug_st25_fail_step = 66; // MAX configured, preparing selected path
                BIOZ_SELECT_TARGET();
                bioz_prepare_selected_path();

                debug_st25_fail_step = 67; // collecting live MAX BioZ average

                target_avg = max30002_collect_bioz_average(16);

                if (debug_max_collect_failed) {
                    debug_st25_fail_step = 68; // MAX BioZ collection timed out
                    error_handler();
                }
                // BASELINE MEASUREMENT
                debug_max_collect_failed = 0;
                debug_max_wait_timeout_count = 0;
                max_flag = 0;
                debug_st25_fail_step = 69; // selecting baseline path
                BIOZ_SELECT_BASELINE();

                bioz_prepare_selected_path();

                debug_st25_fail_step = 70; // collecting baseline BioZ average

                reference_avg = max30002_collect_bioz_average(16);

                if (debug_max_collect_failed) {
                    debug_st25_fail_step = 71; // baseline MAX BioZ collection timed out
                    error_handler();
                }


                debug_target_bioz = target_avg;
                debug_baseline_bioz = reference_avg;
                debug_bioz_diff = target_avg - reference_avg;

                debug_st25_fail_step = 67; // BioZ collected, about to build result URL

                msg_len = build_bioz_ndef_text_msg(msg, sizeof(msg), target_avg, reference_avg);

                if (msg_len == 0) {
                    debug_st25_fail_step = 61; // result URL builder failed
                    error_handler();
                }

                debug_st25_fail_step = 62; // result URL built, about to write EEPROM

                if (st25dv_write_ndef_text_eeprom(msg, msg_len)) {
                    __delay_cycles(100000);

                    demo_result_pending = 1; // next tap resets to ready
                    phone_flag = 0; // clear stale phone event that may have occurred during processing
                    P2IFG &= ~BIT0; // clear stale GPO interrupt flag

                    debug_st25_fail_step = 0;
                    led_pulse_transmission(); // one pulse = result saved
                }
                else {
                    debug_st25_fail_step = 63; // result EEPROM write failed
                    error_handler();
                }
            }
            else {
                // Second tap: phone is opening the result page.
                // Wait long enough for user/phone to load result, then reset tag to ready.

                debug_st25_fail_step = 70;

