neosoultech/bioimpedance_msp430_test/main.c
                __delay_cycles(5000000); // 5 sec delay so phone can open/read result URL

                msg_len = build_scanning_url_ndef(msg, sizeof(msg));

                if (msg_len == 0) {
                    debug_st25_fail_step = 71; // scan URL builder failed
                    error_handler();
                }

                debug_st25_fail_step = 72; // scan URL built, about to write EEPROM

                if (st25dv_write_ndef_text_eeprom(msg, msg_len)) {
                    __delay_cycles(100000);

                    demo_result_pending = 0; // next tap measures again
                    phone_flag = 0; // clear stale phone event
                    P2IFG &= ~BIT0; // clear stale GPO interrupt flag

                    debug_st25_fail_step = 0;
                    led_double_pulse(); // two pulses = reset to ready
                }

                else {
                    debug_st25_fail_step = 73; // scan EEPROM write failed
                    error_handler();
                }
            }
        }
        else {
            led_idle();
        }

    #elif TEST_MAX_SPI // TEST 5: Basic MAX30002 SPI connection test. Checks to see if reads anything from INFO
	    uint32_t info;
	    max30002_reset(); // RESET to start from known state
	    (void)max30002_read_status(); // INFO should not be first command after power-up/reset
	    __delay_cycles(10000);

	    info = max30002_read_info();
	    if ((info != 0x000000) && (info != 0xFFFFFF)) { // check to see if anything there
	        led_pulse_transmission(); // Pulse LED; SPI returned something plausible
	    }
	    else {
	        error_handler(); // likely SPI wiring or mode issue. SOLID LED
	    }
	    __delay_cycles(1000000);

	 #elif TEST_MAX_ID // TEST 6: More in depth MAX30002 SPI communication test. Reads/compares info register.
	    uint32_t info;
	    max30002_reset(); // RESET to start from known state
	    (void)max30002_read_status(); // read status first as dummy transaction. Cannot read info command right away per data sheet.
	    __delay_cycles(10000); // 10ms delay

	    info = max30002_read_info(); // read info register just as a test for SPI communication
	    debug_info = info;
	    if ((info & 0xF03000) == 0x501000) { // MAX30001 INFO fixed bits: D[23:20] = 0101 and D[13:12] = 01. Mask 0xF03000 should equal 0x501000. INFO is not valid as the first command after SW_RST.

	        led_pulse_transmission(); // pulse LED if what read looks valid
	    }
	    else {
	        error_handler(); // solid LED
	    }
	    __delay_cycles(1000000); // 1 second between test

    #elif TEST_MAX_CONFIG // TEST 7: Write to and read from MAX30002 config registers
	    uint32_t en_int_read;
	    max30002_reset(); // RESET to start from known state
	    (void)max30002_read_status(); // read status first as dummy transaction
	    __delay_cycles(10000); // 10ms delay

	    max30002_write_reg(MAX_REG_EN_INT, 0x000002); // writing to low bits of EN_INT register. Open drain NMOS without internal pull up
	    __delay_cycles(10000); // 10 ms delay
	    en_int_read = max30002_read_reg(MAX_REG_EN_INT); // read what we just wrote
	    debug_en_int_read = en_int_read;
	    if ((en_int_read & 0x000003) == MAX_INTB_OPEN_DRAIN) { // lower bits should be '10 (2 decimal)' for open drain
	        debug_config_pass = 1;
	        led_pulse_transmission(); // config write/read worked
	    }
	    else {
	        debug_config_pass = 2;
	        error_handler(); // solid LED if error
	    }
	    __delay_cycles(1000000); // 1 second between tests

    #elif TEST_MAX_START // TEST 8: Configure and start MAX30002 BioZ operation
	    uint32_t bmux;
	    uint32_t en_int_read;
	    uint32_t gen_read;
	    uint32_t mngr_int_read;
	    uint32_t bmux_read;
	    uint32_t bioz_read;

	    max30002_reset(); // reset to known state
	    (void)max30002_read_status(); // dummy transaction. Can't do INFO as first command after reset.
	    __delay_cycles(10000); // 10 ms delay
	    BIOZ_SELECT_TARGET();
	    __delay_cycles(50000); // let mux/electrode path settle

	    max30002_write_reg(MAX_REG_EN_INT, MAX_CFG_EN_INT_START); // Configure INTB: allow BioZ FIFO interrupt & overflow to drive INTB, use open drain INTB output
	    max30002_write_reg(MAX_REG_MNGR_INT, MAX_CFG_MNGR_INT_START); // Configure interrupt manager so interrupt if >=1 BioZ sample in FIFO, and interrupt flag clears auto.
	    max30002_write_reg(MAX_REG_CNFG_BIOZ, MAX_CFG_CNFG_BIOZ_START); // Configure BioZ channel: 32sps, 8.192Khz, low noise, 10V/V gain, midrange current magnitude

	    bmux = max30002_read_reg(MAX_REG_CNFG_BMUX); // read BMUX config
	    bmux &= ~(MAX_BMUX_OPENP_BIT | MAX_BMUX_OPENN_BIT); // clear OPENP AND OPENN so BIP and BIN connected to BioZ channel
	    max30002_write_reg(MAX_REG_CNFG_BMUX, bmux); // Connected BIP & BIN to BioZ channel

	    max30002_write_reg(MAX_REG_CNFG_GEN, MAX_CFG_CNFG_GEN_START); // Enable BioZ & internal lead biasing. Requires EN_BIOZ to be asserted same time (done)
	    __delay_cycles(100000); // 0.1s startup

	    // Reset FIFO
	    max30002_fifo_reset();
	    max30002_synch();
	    __delay_cycles(100000); // allow BioZ to begin running

	    en_int_read   = max30002_read_reg(MAX_REG_EN_INT); // reading registers
	    mngr_int_read = max30002_read_reg(MAX_REG_MNGR_INT);
	    gen_read      = max30002_read_reg(MAX_REG_CNFG_GEN);
	    bmux_read     = max30002_read_reg(MAX_REG_CNFG_BMUX);
	    bioz_read     = max30002_read_reg(MAX_REG_CNFG_BIOZ);

	    debug_en_int_start = en_int_read;
	    debug_mngr_int_start = mngr_int_read;
	    debug_gen_start = gen_read;
	    debug_bmux_start = bmux_read;
	    debug_bioz_start = bioz_read;

	    if (((en_int_read & MAX_CFG_EN_INT_START) == MAX_CFG_EN_INT_START) && // check that the registers have been altered
	                ((mngr_int_read & MAX_CFG_MNGR_INT_START) == MAX_CFG_MNGR_INT_START) &&
	                ((gen_read & MAX_CFG_CNFG_GEN_START) == MAX_CFG_CNFG_GEN_START) &&
	                ((bmux_read & (MAX_BMUX_OPENP_BIT | MAX_BMUX_OPENN_BIT)) == 0) &&
	                (bioz_read == MAX_CFG_CNFG_BIOZ_START)) {
	        int i;
	        for (i = 0; i < 6; i++) {
	                        debug_start_pass = 1;
	                        led_blink_measuring(); // Blink while measuring if success
	                    }

	                    led_idle(); // stop blinking
	                }
	                else {
	                    debug_start_pass = 2;
	                    error_handler(); // solid LED if config/start failed
	    }
	    __delay_cycles(1000000); // 1 second between tests

    #elif TEST_MAX_READ

	    uint32_t status;
	    uint32_t raw;
	    int32_t bioz;

	    max30002_reset(); // reset before use, read status as first command
	    (void)max30002_read_status();
	    __delay_cycles(10000);
	    BIOZ_SELECT_TARGET();
	    __delay_cycles(50000); // let mux/electrode path settle

