neosoultech/bioimpedance_msp430_test/main.c
	    max30002_write_reg(MAX_REG_EN_INT, MAX_CFG_EN_INT_START); // setup for MAX
	    max30002_write_reg(MAX_REG_MNGR_INT, MAX_CFG_MNGR_INT_START);

	    uint32_t bmux = max30002_read_reg(MAX_REG_CNFG_BMUX);
	        bmux &= ~(MAX_BMUX_OPENP_BIT | MAX_BMUX_OPENN_BIT);
	        max30002_write_reg(MAX_REG_CNFG_BMUX, bmux);

	        max30002_write_reg(MAX_REG_CNFG_BIOZ, MAX_CFG_CNFG_BIOZ_START);
	            max30002_write_reg(MAX_REG_CNFG_GEN, MAX_CFG_CNFG_GEN_START);

	            __delay_cycles(100000); // delay

	                max30002_fifo_reset(); // reset FIFO to prepare for measurement
	                max30002_synch();

	                __delay_cycles(100000);

	                debug_print_count = 0;

// READ LOOP:
	                while(1) {
	                    if (max_flag) { // set by ISR on INTB
	                        max_flag = 0; // reset flag
	                        status = max30002_read_status(); // read its status

	                        if (status & MAX_STATUS_BOVF) { // checking first for global overflow
	                            debug_bovf_count++;
	                            max30002_fifo_reset();
	                            continue; // go back to waiting for next MAX interrupt
	                        }
	                        while (status & MAX_STATUS_BINT) { // if FIFO here
	                            raw = max30002_read_fifo(); // read it

	                            uint8_t tag = raw & 0x07;  // extract BTAG bits (bottom 3)
	                            if (tag == 0x07) { // 111: FIFO overflow
	                            max30002_fifo_reset();
	                            break;
	                            }
	                            if (tag == 0x06) { // 110: Empty
	                                break; // skip to get more data
	                            }
	                            if (tag == 0x00 || tag == 0x02) { // Cases of guaranteed valid data
	                                bioz = bioz_parse(raw);
	                                debug_bioz = bioz;
	                                sample_count++; // debug; count samples recieved
	                                if (bioz_log_i < BIOZ_LOG_N) {
	                                    bioz_log_value[bioz_log_i] = bioz;
	                                    bioz_log_i++;

	                                    if (bioz_log_i >= BIOZ_LOG_N) {
	                                        bioz_log_done = 1;
	                                    }
	                                }
	                                LED_TOGGLE(); // if successful read, blink if FIFO producing data
	                            }
	                            else if (tag == 0x01 || tag == 0x03){ // Over-under. Cases of questionably valid data
	                                bioz = bioz_parse(raw);
	                                debug_bioz = bioz;
	                            }
	                            if (tag == 0x02 || tag == 0x03) { // if EOF, stop draining FIFO
	                                break;
	                            }
	                            status = max30002_read_status(); // check if there are more samples to read
	                        }
	                      }
	                    }

    #elif TEST_MAX_2SPOT
	// Custom patch test: ADG884 mux automatically switches between target and baseline/reference electrodes.
	int32_t target_avg;
	int32_t baseline_avg;
	int32_t diff;

	max30002_configure_bioz_once(); // configure BioZ

	BIOZ_SELECT_TARGET();           // target selected
	bioz_prepare_selected_path();   // prepare for BioZ measurement
	target_avg = max30002_collect_bioz_average(16); // average of 16 parsed raw BioZ samples
	BIOZ_SELECT_BASELINE();         // baseline selected
	bioz_prepare_selected_path();   // prepare for BioZ measurement
	baseline_avg = max30002_collect_bioz_average(16);  // average of 16 parsed raw BioZ samples
	diff = target_avg - baseline_avg;   // difference between target and baseline
	debug_target_bioz = target_avg;     // debug for CCS window
	debug_baseline_bioz = baseline_avg; // debug for CCS window
	debug_bioz_diff = diff;             // debug for CCS window

	led_pulse_transmission(); // indicates one full target & baseline cycle completed
	__delay_cycles(1000000);

    #elif TEST_MAX_2SPOT_MANUAL
	// Eval-kit/manual test: user places electrodes on target, presses S1,
	// then moves electrodes to baseline/reference area and presses S1 again.
	// Does not use ADG884 mux.
	int32_t target_avg;
	int32_t baseline_avg;
	int32_t diff;

	max30002_configure_bioz_once(); // configure BioZ startup
// STEP 1: Place electrodes on target. Press S1 when ready.
	wait_for_s1_press();
	bioz_prepare_selected_path();
	target_avg = max30002_collect_bioz_average(16);  // average of 16 measurements
	debug_target_bioz = target_avg; // debug
	led_pulse_transmission(); // pulse for success in target measurement
// STEP 2: Move same electrodes to the baseline area. Press S1 when ready.
	wait_for_s1_press();
	bioz_prepare_selected_path();
	baseline_avg = max30002_collect_bioz_average(16);
	debug_baseline_bioz = baseline_avg; // average of 16 measurements

	diff = target_avg - baseline_avg; // difference b/w target and baseline
	debug_bioz_diff = diff; // debug

	led_pulse_transmission(); // pulse for success in baseline measurement
	__delay_cycles(1000000);

#elif TEST_BUILD_BIOZ_MSG_ONLY
    // No-hardware test.
    // This only tests whether the BIOZ NDEF text message is built correctly.
    // It does not use MAX hardware and does not use ST25 hardware.

    demo_msg_len = build_bioz_ndef_text_msg((uint8_t *)demo_msg,
                                            sizeof(demo_msg),
                                            demo_fake_target,
                                            demo_fake_reference);

    if (demo_msg_len == 0) {
        error_handler();
    }

    led_pulse_transmission();

    while (1) {
        // Hold here so CCS can inspect demo_msg and demo_msg_len.
    }


    #endif // ends test chain
    #endif // end program

#if USE_LPM
	__bis_SR_register(LPM0_bits | GIE); // enter low power mode, enable interrupts
#else
	    __delay_cycles(200000); // delay by 0.2s
#endif
	}
}

