neosoultech/bioimpedance_msp430_test/main.c
    if (!(P2IN & BIT1)) { // if P2.1 reads as 0, INTB is alr active, so set max_flag manually
            max_flag = 1;
        }

}

void fclk_init(void) { // helper function to set up ACLK between MCU and MAX30002
    CSCTL4 |= SELA__REFOCLK; // set ACLK source to REFO (~32 KHz)

    P2DIR |= BIT2; // 2.2 becomes output
    P2SEL0 &= ~BIT2; // setting P2SEL0.2 value to 0
    P2SEL1 |= BIT2; // P2SEL1.2 value set to 1. Both of these lines make (Sel1,Sel0) as (1,0) to select ACLK output
}

uint8_t spi_transfer(uint8_t data) { // helper function to transfer over SPI (both ways at same time)
    while (!(UCA0IFG & UCTXIFG)); // wait until TX buffer ready
    UCA0TXBUF = data; // put data into TX buffer
    while (!(UCA0IFG & UCRXIFG)); // while no RX interrupts
    return UCA0RXBUF; // get information coming into RX buffer
}

void bioz_mux_init(void) { // helper function to choose between ADG884 pins. P2.7 is BIOZ_MUX_SEL output
    P2SEL0 &= ~BIOZ_MUX_SEL_BIT; // GPIO MODE
    P2SEL1 &= ~BIOZ_MUX_SEL_BIT; // GPIO MODE
    BIOZ_SELECT_TARGET(); // default to target electrodes
    P2DIR |= BIOZ_MUX_SEL_BIT; // make P2.7 output
    P2REN &= ~BIOZ_MUX_SEL_BIT; // disable internal pull resistor
    P2IE &= ~BIOZ_MUX_SEL_BIT; // no interrupt on mux sel pin
    P2IFG &= ~BIOZ_MUX_SEL_BIT; // clear any stale flags
}

uint32_t max30002_read_reg(uint8_t reg) { // helper function to read data from a register from max30002
    uint32_t data = 0;
    MAX_CS_LOW(); // enable MAX30002
    spi_transfer(((reg & 0x7F) << 1) | 0x01); // Send command byte. Format is 7 bit address + R/W indicator
    data |= ((uint32_t)spi_transfer(0x00) << 16); // getting top data byte
    data |= ((uint32_t)spi_transfer(0x00) << 8); // getting middle data byte
    data |= ((uint32_t)spi_transfer(0x00)); // getting bottom data byte
    MAX_CS_HIGH(); // disable MAX30002

    return data; // what we read from register 'reg'
}

void max30002_write_reg(uint8_t reg, uint32_t data) { // Helper function to write to MAX30002 reg
    MAX_CS_LOW(); // enable MAX30002
    spi_transfer(((reg & 0x7F) << 1) | 0x00); // Send command byte. Same as before, but 0 LSB for write
    spi_transfer((data >> 16) & 0xFF); // top byte of data
    spi_transfer((data >> 8) & 0xFF); // middle byte of data
    spi_transfer((data) & 0xFF); // bottom byte of data
    MAX_CS_HIGH(); // disable MAX30002
}

void max30002_reset(void) { // resets max30002
    max30002_write_reg(MAX_REG_SW_RST, 0x000000);
    __delay_cycles(100000); // 0.1 s delay
}

void max30002_synch(void) { // Begins new BIOZ operations on clock edge. Clears FIFO memory
    max30002_write_reg(MAX_REG_SYNCH, 0x000000);
    __delay_cycles(10000); // 10 ms delay
}

void max30002_fifo_reset(void) { // Begins new BIOZ operations by resetting FIFO. Operations of BIOZ active circuitry not impacted. (No settling/transients)
    max30002_write_reg(MAX_REG_FIFO_RST, 0x000000);
    __delay_cycles(10000); // 10ms delay
}

uint32_t max30002_read_status(void) { // how to determine why MAX interrupted
    return max30002_read_reg(MAX_REG_STATUS);
}

uint32_t max30002_read_info(void) { // gives interface/part/revision information
    return max30002_read_reg(MAX_REG_INFO);
}

uint32_t max30002_read_fifo(void) { // reads BIOZ FIFO at register 0x23. Uses same 32-clock read sequence.
    return max30002_read_reg(MAX_REG_FIFO);
}

int32_t bioz_parse(uint32_t raw) { // helper function to parse bioZ data. Bits [2:0] are status bits and bits [23:4] are the data.
    int32_t data = (int32_t)(raw >> 4)  & 0xFFFFF; // extract 20-bit signed BioZ sample
    if (data & 0x80000) // if bit 19 is 1 (negative)
        data |= 0xFFF00000; // sign-extend 20-bit value to 32-bit signed int
    return (int32_t) data; // returning the parsed data bits
}

void max30002_configure_bioz_once(void) { // configures the MAX30002 for bioimpedance sensing. Only needs to occur once
    uint32_t bmux;

    max30002_reset(); // reset to known state
    (void)max30002_read_status(); // dummy transaction. Can't do INFO as first command after reset.
    __delay_cycles(10000); // 10 ms delay

    max30002_write_reg(MAX_REG_EN_INT, MAX_CFG_EN_INT_START); // Configure INTB: allow BioZ FIFO interrupt & overflow to drive INTB, use open drain INTB output
    max30002_write_reg(MAX_REG_MNGR_INT, MAX_CFG_MNGR_INT_START); // Configure interrupt manager so interrupt if >=1 BioZ sample in FIFO, and interrupt flag clears auto.
    max30002_write_reg(MAX_REG_CNFG_BIOZ, MAX_CFG_CNFG_BIOZ_START); // Configure BioZ channel: 32sps, 8.192Khz, low noise, 10V/V gain, midrange current magnitude

    bmux = max30002_read_reg(MAX_REG_CNFG_BMUX); // read BMUX config
    bmux &= ~(MAX_BMUX_OPENP_BIT | MAX_BMUX_OPENN_BIT); // clear OPENP AND OPENN so BIP and BIN connected to BioZ channel
    max30002_write_reg(MAX_REG_CNFG_BMUX, bmux); // Connected BIP & BIN to BioZ channel

    max30002_write_reg(MAX_REG_CNFG_GEN, MAX_CFG_CNFG_GEN_START); // Enable BioZ & internal lead biasing. Requires EN_BIOZ to be asserted same time (done)
    __delay_cycles(100000); // 0.1s startup
}

void bioz_prepare_selected_path(void) { // helper function to get ready for BioZ sample
    max_flag = 0; // clear stale interrupt flag
    __delay_cycles(50000); // Allow selected electrode path/contact to settle.
    max30002_fifo_reset(); // clear old samples
    max30002_synch(); // restart bioZ sample timing & alignment
    // Let BioZ samples settle after restart.
    __delay_cycles(1000000);        // 1.0 s

}

int32_t max30002_collect_bioz_average(uint16_t sample_goal) // takes average of n x 2 samples; if the n first trials and the n second trials are not similar, it will discard the outlier.
{
    uint32_t status;
    uint32_t raw;
    uint8_t tag;
    int32_t bioz;
    uint32_t wait_timeout = 0;

    int64_t sum1 = 0;
    int64_t sum2 = 0;

    uint16_t count1 = 0;
    uint16_t count2 = 0;
    uint16_t discard_count = 0;

    int32_t avg1;
    int32_t avg2;
    int32_t diff;

    while (count2 < sample_goal) {
        if (!max_flag) {
            wait_timeout++;

